#!/usr/bin/env python
# encoding: utf-8


articles = [
    {
        "ranking": 1,
        "title": "病人1",
        "author": 1,
        "content": "患者杨某，男，20岁，学生。酗酒后遭雨淋，于当天晚上突然起病，寒颤、高热、呼吸困难、胸痛，继而咳嗽，咳铁锈色痰，其家属急送当地医院就诊。听诊，左肺下叶有大量湿性啰音；触诊语颤增强；血常规：WBC：17X10°儿；X线检查，左肺下叶有大片致密阴影。入院经抗生素治疗，病情好转，各种症状逐渐消失；X线检查，左肺下叶的大片致密阴影缩小2/3面积。病人于入院后第7天自感无症状出院。冬季征兵体检，X线检查左肺下叶有约3cmX2cm大小不规则阴影，周围边界不清，怀疑內“支气管肺癌”。在当地医院即做左肺下叶切除术。病理检查，肺部肿块肉眼为红褐色肉样，镜下为肉芽组织。",
        "desc": "大叶性肺炎",
    },
    {
        "ranking": 2,
        "title": "病人2",
        "author": 1,
        "content": "男性 5 5岁，高血压病史 10年，未系统治疗。近半月，骑车或走路急快时感胸骨后闷痛，同时左肩臂酸胀，停止活动，经3～5分钟缓解。3小时前无明显诱因突然发生胸骨后中段闷痛，不向他处放散，伴气短，出汗及恶心，持续20min后缓解，1小时前又出现上述症状持续不缓解急诊来院。",
        "desc": "高血压",
    },
    {
        "ranking": 3,
        "title": "病人3",
        "author": 1,
        "content": "患者，男，38岁，医生。突然上腹剧痛，并放射到肩部，呼吸时疼痛加重3小时，急诊人院。20多年前开始上腹部疼痛，以饥饿时明显，伴返酸、嗳气，有时大便隐血（+）。每年发作数次，多在秋冬之交和春夏之交，或饮食不当时发作，服硷性药物缓解。5年前疾病发作时解柏油样大便，人软，无力，进食后上腹痛加剧，伴呕吐，呕吐物为食物，经中药治疗后缓解。人院前3天自觉每天15时～16时及22时上腹不适，未予注意。人院前3小时突然上腹部剧痛，放射到右肩部，面色苍白，大汗淋漓人院。",
        "desc": "十二指肠溃疡穿孔",
    },
    {
        "ranking": 4,
        "title": "病人4",
        "author": 1,
        "content": "患者杨某，男，20岁，学生。酗酒后遭雨淋，于当天晚上突然起病，寒颤、高热、呼吸困难、胸痛，继而咳嗽，咳铁锈色痰，其家属急送当地医院就诊。听诊，左肺下叶有大量湿性啰音；触诊语颤增强；血常规：WBC：17X10°儿；X线检查，左肺下叶有大片致密阴影。入院经抗生素治疗，病情好转，各种症状逐渐消失；X线检查，左肺下叶的大片致密阴影缩小2/3面积。病人于入院后第7天自感无症状出院。冬季征兵体检，X线检查左肺下叶有约3cmX2cm大小不规则阴影，周围边界不清，怀疑內“支气管肺癌”。在当地医院即做左肺下叶切除术。病理检查，肺部肿块肉眼为红褐色肉样，镜下为肉芽组织。",
        "desc": "大叶性肺炎",
    },
    {
        "ranking": 5,
        "title": "病人5",
        "author": 1,
        "content": "患者杨某，男，20岁，学生。酗酒后遭雨淋，于当天晚上突然起病，寒颤、高热、呼吸困难、胸痛，继而咳嗽，咳铁锈色痰，其家属急送当地医院就诊。听诊，左肺下叶有大量湿性啰音；触诊语颤增强；血常规：WBC：17X10°儿；X线检查，左肺下叶有大片致密阴影。入院经抗生素治疗，病情好转，各种症状逐渐消失；X线检查，左肺下叶的大片致密阴影缩小2/3面积。病人于入院后第7天自感无症状出院。冬季征兵体检，X线检查左肺下叶有约3cmX2cm大小不规则阴影，周围边界不清，怀疑內“支气管肺癌”。在当地医院即做左肺下叶切除术。病理检查，肺部肿块肉眼为红褐色肉样，镜下为肉芽组织。",
        "desc": "大叶性肺炎",
    },
]
